# Import Libraries

In [1]:
#import libraries
import numpy as np
import pandas as pd
import os

# Import Data Sets

In [2]:
#import data sets
path = r'/Users/oliviamurphy/Desktop/2022-01 Insta Cart Analysis/02 Data'
df_prods = pd.read_csv(os.path.join(path, 'Prepared Data', 'prods_wrangled.csv'), index_col=[0])
df_ords = pd.read_csv(os.path.join(path, 'Prepared Data', 'ords_wrangled.csv'), index_col = [0])
df_cust = pd.read_csv(os.path.join(path, 'Prepared Data', 'cust_wrangled.csv'), index_col = [0])
df_dep = pd.read_csv(os.path.join(path, 'Prepared Data', 'dep_wrangled.csv'), index_col = [0])
df_ords_prods_prior = pd.read_csv(os.path.join(path, 'Prepared Data', 'df_ords_prods_prior_wrangled.csv'), index_col = [0])

/Users/oliviamurphy/opt/anaconda3/lib/python3.9/site-packages/numpy/lib/arraysetops.py:583: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask |= (ar1 == a)

# Change Data types

In [3]:
# changes data types to strings
df_ords['order_id'] = df_ords['order_id'].astype('string')
df_ords['user_id'] = df_ords['user_id'].astype('string')
df_prods['aisle_id'] = df_prods['aisle_id'].astype('string')
df_prods['product_id'] = df_prods['product_id'].astype('string')
df_prods['department_id'] = df_prods['department_id'].astype('string')
df_ords_prods_prior['order_id'] = df_ords_prods_prior['order_id'].astype('string')
df_ords_prods_prior['product_id'] = df_ords_prods_prior['product_id'].astype('string')
df_cust['user_id'] = df_cust['user_id'].astype('string')

# Mixed-Type Data

In [4]:
#check for mixed types in df_prods
for col in df_prods.columns.tolist():
    weird =(df_prods[[col]].applymap(type) !=df_prods[[col]].iloc[0].apply(type)).any(axis =1)
    if len (df_prods[weird])>0:
        print(col)

product_name

In [5]:
#converting mixed type values for df_prods['product_name']
df_prods['product_name'] = df_prods['product_name'].astype('str')
df_prods['product_name']

0                               Chocolate Sandwich Cookies
1                                         All-Seasons Salt
2                     Robust Golden Unsweetened Oolong Tea
3        Smart Ones Classic Favorites Mini Rigatoni Wit...
4                                Green Chile Anytime Sauce
                               ...
49688            Vodka, Triple Distilled, Twist of Vanilla
49689                   En Croute Roast Hazelnut Cranberry
49690                                     Artisan Baguette
49691           Smartblend Healthy Metabolism Dry Cat Food
49692                               Fresh Foaming Cleanser
Name: product_name, Length: 49693, dtype: object

In [6]:
#check for mixed types in df_ords
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords[weird])>0:
        print(col)
# no mixed type variables

In [7]:
# checks for mixed types in df_cust
for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird])>0:
        print (col)
# no mixed type variables

In [8]:
# checks for mixed types in df_dep
for col in df_dep.columns.tolist():
    weird = (df_dep[[col]].applymap(type) != df_dep[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_dep[weird])>0:
        print(col)
# no mixed type variables

In [9]:
# checks for mixed types in df_ords_prods_prior
for col in df_ords_prods_prior.columns.tolist():
    weird = (df_ords_prods_prior[[col]].applymap(type) != df_ords_prods_prior[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords_prods_prior[weird]>0):
        print(col)
# no mixed type variables

# Missing Values

In [10]:
#finding count of missing values in df_prods
df_prods.isnull().sum()

product_id       0
product_name     0
aisle_id         0
department_id    0
prices           0
dtype: int64

In [11]:
#finding count of missing values in df_ords
df_ords.isnull().sum()

order_id                             0
user_id                              0
order_number                         0
orders_day_of_week                   0
order_hour_of_day                    0
days_passed_since_last_order    206209
dtype: int64

In [12]:
# prints missing values for df_ords
df_ords_missing_values = df_ords[df_ords['days_passed_since_last_order'].isnull()==True]
df_ords_missing_values
# There are 206209 missing values in the days_since_prior_order column. Perhaps these customers have only ordered once, so there is no prior order to reference.
# leave null values, as they will autofill when the customer makes another order.

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_passed_since_last_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [13]:
#finding count of missing values in df_dep
df_dep.isnull().sum()

department    0
dtype: int64

In [14]:
#finding count of missing values in df_cust
df_cust.isnull().sum()

user_id                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
family_status           0
income                  0
dtype: int64

In [15]:
#finding count of missing values in df_ords_prods_prior
df_ords_prods_prior.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

# Duplicates

In [16]:
# creates dataframe from df_prod for duplcates
dupes_prods = df_prods[df_prods.duplicated()]
# five dupes

In [17]:
# outputs dupes from df_prod
dupes_prods

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [18]:
# drops duplicates from df_prod
df_prods= df_prods.drop_duplicates()

In [19]:
df_prods.shape

(49688, 5)

In [20]:
# creates dataframe from df_prod for duplcates
dupes_prods = df_prods[df_prods.duplicated()]

In [21]:
# outputs dupes from df_prod
dupes_prods
# no duplicates now

Empty DataFrame
Columns: [product_id, product_name, aisle_id, department_id, prices]
Index: []

In [22]:
# creates dataframe from df_ords for duplcates
dupes_ords = df_ords[df_ords.duplicated()]

In [23]:
# outputs dupes from df_ords
dupes_ords

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_passed_since_last_order]
Index: []

In [24]:
# creates dataframe from df_dep for duplcates
dupes_dep = df_dep[df_dep.duplicated()]

In [25]:
# outputs dupes from df_dep
dupes_dep 
#no dupes

Empty DataFrame
Columns: [department]
Index: []

In [26]:
# creates dataframe from df_cust for duplcates
dupes_cust = df_cust[df_cust.duplicated()]

In [27]:
# outputs dupes from df_cust
dupes_cust
# no duplicates

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

In [28]:
# creates dataframe from df_ords_prods_prior for duplcates
dupes_ords_prods_prior = df_ords_prods_prior[df_ords_prods_prior.duplicated()]

In [29]:
# outputs dupes from df_ords_prods_prior
dupes_ords_prods_prior
# no duplicates

Empty DataFrame
Columns: [order_id, product_id, add_to_cart_order, reordered]
Index: []

# Accuracy Checks

## df_prods (Accuracy Checks)

In [30]:
# outputs variable info for df_prods
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49688 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49688 non-null  string
 1   product_name   49688 non-null  object
 2   aisle_id       49688 non-null  string
 3   department_id  49688 non-null  string
 4   prices         49688 non-null  float64
dtypes: float64(1), object(1), string(3)
memory usage: 2.3+ MB

In [31]:
# prints descriptive stats for df_prods
df_prods.describe()
# the max for the prices and aisle_id should be investigated further. 9999 seems like a very high price for the products instacart sells. 134 aisles seem quite large for a location. While these numbers may be okay, it would be nice to have someone who is familiar with the company to check.

             prices
count  49688.000000
mean       9.994254
std      453.542503
min        1.000000
25%        4.100000
50%        7.100000
75%       11.200000
max    99999.000000

In [32]:
# checks for prices over 100 in df_prods['prices']
df_prods.loc[df_prods['prices']>100]

,product_id,product_name,aisle_id,department_id,prices
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0
33666,33664,2 % Reduced Fat Milk,84,16,99999.0

In [33]:
# replaces values over 100 with Na in df_prods['prices']
df_prods.loc[df_prods['prices']>100, 'prices'] = np.nan

In [34]:
# value counts for df_prods['aisle_id']
df_prods['aisle_id'].value_counts()

100    1258
45     1246
37     1091
47     1038
120    1026
       ...
113      47
82       44
32       32
68       26
18       12
Name: aisle_id, Length: 134, dtype: Int64

In [35]:
# value counts for df_prods['department_id']
df_prods['department_id'].value_counts(dropna = False).sort_values()

10      38
2      548
12     907
8      972
5     1054
18    1081
14    1115
6     1139
21    1258
20    1322
3     1516
4     1684
9     1858
15    2092
17    3085
16    3449
1     4007
7     4365
13    5371
19    6264
11    6563
Name: department_id, dtype: Int64

## df_ords (Accuracy Checks)

In [36]:
# outputs variable info for df_ords
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                        Dtype
---  ------                        -----
 0   order_id                      string
 1   user_id                       string
 2   order_number                  int64
 3   orders_day_of_week            int64
 4   order_hour_of_day             int64
 5   days_passed_since_last_order  float64
dtypes: float64(1), int64(3), string(2)
memory usage: 182.7 MB

In [37]:
# outputs descriptive stats for df_ords
df_ords.describe()

,order_number,orders_day_of_week,order_hour_of_day,days_passed_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [38]:
# value counts for df_ords['orders_day_of_week']
df_ords['orders_day_of_week'].value_counts(dropna = False).sort_index()

0    600905
1    587478
2    467260
3    436972
4    426339
5    453368
6    448761
Name: orders_day_of_week, dtype: int64

In [39]:
# value counts for df_ords['order_hour_of_day']
df_ords['order_hour_of_day'].value_counts(dropna = False).sort_index()
# There are 206209 missing values in the days_since_prior_order column. Perhaps these customers have only ordered once, so there is no prior order to reference.
# leave null values, as they will autofill when the customer makes another order.

0      22758
1      12398
2       7539
3       5474
4       5527
5       9569
6      30529
7      91868
8     178201
9     257812
10    288418
11    284728
12    272841
13    277999
14    283042
15    283639
16    272553
17    228795
18    182912
19    140569
20    104292
21     78109
22     61468
23     40043
Name: order_hour_of_day, dtype: int64

In [40]:
# value counts for df_ords['order_hour_of_day']
df_ords['days_passed_since_last_order'].value_counts(dropna = False).sort_index()

0.0      67755
1.0     145247
2.0     193206
3.0     217005
4.0     221696
5.0     214503
6.0     240013
7.0     320608
8.0     181717
9.0     118188
10.0     95186
11.0     80970
12.0     76146
13.0     83214
14.0    100230
15.0     66579
16.0     46941
17.0     39245
18.0     35881
19.0     34384
20.0     38527
21.0     45470
22.0     32012
23.0     23885
24.0     20712
25.0     19234
26.0     19016
27.0     22013
28.0     26777
29.0     19191
30.0    369323
NaN     206209
Name: days_passed_since_last_order, dtype: int64

## df_cust (Accuracy Checks)

In [41]:
# outputs variable info for df_ords
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  string
 1   gender                206209 non-null  object
 2   state                 206209 non-null  object
 3   age                   206209 non-null  int64
 4   date_joined           206209 non-null  object
 5   number_of_dependants  206209 non-null  int64
 6   family_status         206209 non-null  object
 7   income                206209 non-null  int64
dtypes: int64(3), object(4), string(1)
memory usage: 14.2+ MB

In [42]:
# outputs descriptive stats for df_cust
df_cust.describe()

                 age  number_of_dependants         income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

In [43]:
# value counts for df_cust['state']
df_cust['state'].value_counts(dropna = False).sort_index()

Alabama                 4044
Alaska                  4044
Arizona                 4044
Arkansas                4044
California              4044
Colorado                4044
Connecticut             4044
Delaware                4044
District of Columbia    4044
Florida                 4044
Georgia                 4044
Hawaii                  4044
Idaho                   4044
Illinois                4044
Indiana                 4044
Iowa                    4044
Kansas                  4043
Kentucky                4043
Louisiana               4043
Maine                   4043
Maryland                4043
Massachusetts           4043
Michigan                4043
Minnesota               4043
Mississippi             4043
Missouri                4043
Montana                 4043
Nebraska                4043
Nevada                  4043
New Hampshire           4043
New Jersey              4043
New Mexico              4043
New York                4043
North Carolina          4043
North Dakota            4043
Ohio                    4043
Oklahoma                4043
Oregon                  4043
Pennsylvania            4043
Rhode Island            4043
South Carolina          4043
South Dakota            4043
Tennessee               4043
Texas                   4043
Utah                    4043
Vermont                 4043
Virginia                4043
Washington              4043
West Virginia           4043
Wisconsin               4043
Wyoming                 4043
Name: state, dtype: int64

In [44]:
# value counts for df_cust['gender']
df_cust['gender'].value_counts(dropna = False).sort_index()

Female    102142
Male      104067
Name: gender, dtype: int64

In [45]:
# value counts for df_cust['family_status']
df_cust['family_status'].value_counts(dropna = False).sort_index()

divorced/widowed                     17640
living with parents and siblings      9701
married                             144906
single                               33962
Name: family_status, dtype: int64

In [46]:
# value counts for df_cust['number_of_dependants']
df_cust['number_of_dependants'].value_counts(dropna = False).sort_index()

0    51602
1    51531
2    51482
3    51594
Name: number_of_dependants, dtype: int64

## df_dep (Accuracy Checks)

In [47]:
# outputs variable info for df_dep
df_dep.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21 entries, 1 to 21
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   department  21 non-null     object
dtypes: object(1)
memory usage: 336.0+ bytes

## df_ords_prods_prior (Accuracy Checks)

In [48]:
# outputs variable info for df_ords_prods_prior
df_ords_prods_prior.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434489 entries, 0 to 32434488
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           string
 1   product_id         string
 2   add_to_cart_order  int64
 3   reordered          int64
dtypes: int64(2), string(2)
memory usage: 1.2 GB

In [49]:
# outputs decriptive stats for df_ords_prods_prior
df_ords_prods_prior.describe()

       add_to_cart_order     reordered
count       3.243449e+07  3.243449e+07
mean        8.351076e+00  5.896975e-01
std         7.126671e+00  4.918886e-01
min         1.000000e+00  0.000000e+00
25%         3.000000e+00  0.000000e+00
50%         6.000000e+00  1.000000e+00
75%         1.100000e+01  1.000000e+00
max         1.450000e+02  1.000000e+00

In [50]:
# outputs value counts for df_ords_prods_prior['reordered']
df_ords_prods_prior['reordered'].value_counts()

1    19126536
0    13307953
Name: reordered, dtype: int64

# Checks Shapes of cleaned dataframes

In [51]:
# outputs shape of df_prods
df_prods.shape

(49688, 5)

In [52]:
# outputs shape of df_ords
df_ords.shape

(3421083, 6)

In [53]:
# outputs shape of df_cust
df_cust.shape

(206209, 8)

In [54]:
# outputs shape of df_dep
df_dep.shape

(21, 1)

In [55]:
# outputs shape of df_ords_prods_prior
df_ords_prods_prior.shape

(32434489, 4)

# Export to CSV

In [ ]:
# Exports cleaned dataframes
df_prods.to_csv(os.path.join(path, 'Prepared Data', 'products_cleaned.csv'))
df_ords.to_csv(os.path.join(path, 'Prepared Data', 'ords_cleaned.csv'))
df_cust.to_csv(os.path.join(path, 'Prepared Data', 'cust_cleaned.csv'))
df_dep.to_csv(os.path.join(path, 'Prepared Data', 'dep_cleaned.csv'))
df_ords_prods_prior.to_csv(os.path.join(path, 'Prepared Data', 'df_ords_prods_prior_cleaned.csv'))